<?xml version="1.0"?>
<net name="Model325" version="11">
	<layers>
		<layer id="4" name="y" type="Parameter" version="opset1">
			<data shape="?,513,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="y">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="y_lengths" type="Parameter" version="opset1">
			<data shape="?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="y_lengths">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="sid_src" type="Parameter" version="opset1">
			<data shape="?,256,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="sid_src">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="sid_tgt" type="Parameter" version="opset1">
			<data shape="?,256,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="sid_tgt">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="tau" type="Parameter" version="opset1">
			<data shape="" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="tau" />
			</output>
		</layer>
		<layer id="5" name="Constant_831270" type="Const" version="opset1">
			<data element_type="u8" shape="192, 513, 1" offset="0" size="98496" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Convert_1232884" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_831270/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="192, 1, 1" offset="98496" size="192" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convert_1232887" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_831270/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_831270/scale" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1" offset="98688" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_831270/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_831270/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>513</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="99072" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="49">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="99840" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="17" name="ShapeOf_919168" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_919169" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="99844" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="19" name="Constant_919170" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="99852" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="20" name="Gather_919171" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="13" />
			</output>
		</layer>
		<layer id="21" name="aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="99860" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="22" name="aten::arange/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="20,x.1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="21" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="99852" size="8" />
			<output>
				<port id="0" precision="I64" names="21" />
			</output>
		</layer>
		<layer id="24" name="aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="22">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="23" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64" names="23" />
			</output>
		</layer>
		<layer id="26" name="aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="24">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="25">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="26" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64" names="26" />
			</output>
		</layer>
		<layer id="29" name="aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="27">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="x_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="50,x.3">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="aten::_weight_norm/Multiply" type="Const" version="opset1">
			<data element_type="u8" shape="384, 192, 5" offset="99872" size="368640" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Convert_1016644" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="aten::_weight_norm/Multiply/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="384, 1, 1" offset="468512" size="384" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Convert_1016647" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="aten::_weight_norm/Multiply/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="aten::_weight_norm/Multiply/scale" type="Const" version="opset1">
			<data element_type="f16" shape="384, 1, 1" offset="468896" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="aten::_weight_norm/Multiply/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="aten::_weight_norm/Multiply/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="aten::_convolution/Convolution_1" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="aten::_convolution/Reshape_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1" offset="469664" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="aten::_convolution/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="103,x_in.1">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="aten::zeros_like/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="99840" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="44" name="aten::zeros_like/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="aten::zeros_like/Broadcast_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="11">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="aten::_weight_norm/Multiply_1" type="Const" version="opset1">
			<data element_type="u8" shape="6144, 256, 1" offset="471200" size="1572864" />
			<output>
				<port id="0" precision="U8">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Convert_936084" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="aten::_weight_norm/Multiply_1/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="6144, 1, 1" offset="2044064" size="6144" />
			<output>
				<port id="0" precision="U8">
					<dim>6144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convert_936087" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>6144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>6144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="aten::_weight_norm/Multiply_1/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>6144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="aten::_weight_norm/Multiply_1/scale" type="Const" version="opset1">
			<data element_type="f16" shape="6144, 1, 1" offset="2050208" size="12288" />
			<output>
				<port id="0" precision="FP16">
					<dim>6144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="aten::_weight_norm/Multiply_1/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>6144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="aten::_weight_norm/Multiply_1/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="aten::_convolution/Convolution_2" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>6144</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>6144</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="aten::_convolution/Reshape_2" type="Const" version="opset1">
			<data element_type="f32" shape="1, 6144, 1" offset="2062496" size="24576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6144</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="aten::_convolution/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6144</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6144</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1058,108,1153,1248,1343,1438,1533,203,298,393,488,583,678,773,83,868,963,g.1">
					<dim>-1</dim>
					<dim>6144</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_831537" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99852" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_831539" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087072" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_831541" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_831535" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6144</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="113,118,g_l.1">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="6853,6854,6859,in_act.2">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="aten::slice/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="99840" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_831591" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087080" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_831593" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_831580" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="aten::slice/Slice_4" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="6856,6857">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="aten::tanh/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="6858,t_act.2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_831631" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087080" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="aten::slice/Constant_7" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2087088" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_831634" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_831621" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="aten::slice/Slice_7" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="6861,6862">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="aten::sigmoid/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="6863,s_act.2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="6864,input.1">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="aten::_weight_norm/Multiply_2" type="Const" version="opset1">
			<data element_type="u8" shape="384, 192, 1" offset="2087092" size="73728" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Convert_1237124" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="aten::_weight_norm/Multiply_2/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="384, 1, 1" offset="2160820" size="384" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Convert_1237127" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="aten::_weight_norm/Multiply_2/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="aten::_weight_norm/Multiply_2/scale" type="Const" version="opset1">
			<data element_type="f16" shape="384, 1, 1" offset="2161204" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="aten::_weight_norm/Multiply_2/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="aten::_weight_norm/Multiply_2/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="aten::_convolution/Convolution_3" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="aten::_convolution/Reshape_3" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1" offset="2161972" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="aten::_convolution/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143,148,166,res_skip_acts.1">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_831818" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087080" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_831820" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2163508" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_831822" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_831816" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="aten::slice/Slice_10" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="171,176">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_831765" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99852" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_831767" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087080" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_831769" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_831763" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="aten::slice/Slice_13" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="153,158,res_acts.1">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="160">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="161,x.5">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="aten::_weight_norm/Multiply_3" type="Const" version="opset1">
			<data element_type="u8" shape="384, 192, 5" offset="2163516" size="368640" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_1020884" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="aten::_weight_norm/Multiply_3/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="384, 1, 1" offset="2532156" size="384" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Convert_1020887" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="aten::_weight_norm/Multiply_3/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="aten::_weight_norm/Multiply_3/scale" type="Const" version="opset1">
			<data element_type="f16" shape="384, 1, 1" offset="2532540" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="aten::_weight_norm/Multiply_3/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="aten::_weight_norm/Multiply_3/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="aten::_convolution/Convolution_4" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="aten::_convolution/Reshape_4" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1" offset="2533308" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="aten::_convolution/Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="198,x_in.3">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_831953" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087072" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_831955" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2534844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_831957" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_831951" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="aten::slice/Slice_16" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6144</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="208,213,g_l.3">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="aten::add/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="6870,6871,6876,in_act.4">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="aten::slice/Constant_12" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="99840" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_832007" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087080" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_832009" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_831996" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="aten::slice/Slice_19" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="6873,6874">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="aten::tanh/Tanh_1" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="6875,t_act.4">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_832047" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2087080" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="aten::slice/Constant_17" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2087088" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_832050" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_832037" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="99864" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="aten::slice/Slice_22" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="6878,6879">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="aten::sigmoid/Sigmoid_1" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="6880,s_act.4">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="aten::mul/Multiply_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="6881,input.3">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="aten::_weight_norm/Multiply_4" type="Const" version="opset1">
			<data element_type="u8" shape="384, 192, 1" offset="2534852" size="73728" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Convert_1241364" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="aten::_weight_norm/Multiply_4/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="384, 1, 1" offset="2608580" size="384" />
			<output>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Convert_1241367" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="aten::_weight_norm/Multiply_4/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="aten::_weight_norm/Multiply_4/scale" type="Const" version="opset1">
			<data element_type="f16" shape="384, 1, 1" offset="2608964" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="aten::_weight_norm/Multiply_4/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="aten::_weight_norm/Multiply_4/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="aten::_convolution/Convolution_5" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
